export class StatusService{
    getStatusSeverity(statusId: number): string {
      switch (statusId) {
        // Success (Green)
        case 1500: // เสร็จสิ้น, แปลงเป็นใบแจ้งหนี้แล้ว, แปลงเป็นใบสั่งซื้อแล้ว, สร้างใบกำกับภาษีแล้ว
        case 1700: // แปลงเป็นใบสั่งขาย
        case 700: // ใช้แล้ว, รับแล้ว, รับครบ, ยอมรับ
        case 250: // หยิบสินค้าแล้ว, วางบิลแล้ว, รอเช็คคืน
        case 260: // วางบิลแล้ว
        case 300: // ส่งสินค้าแล้ว
          return "success";

        // Info (Blue)
        case 100: // เช็คในมือ, กำลังจัดสินค้า, กำลังส่งสินค้า, กำลังหยิบสินค้า, ร่าง
        case 200: // เข้าร่วม, จัดสินค้าบางส่วน, ยืนยัน, รอมัดจำ, นำฝาก
        case 120: // รออนุมัติ
        case 150: // วางแผน, รอการนำฝาก, รอตอบรับ, รออนุมัติ
        case 550: // กำลังดำเนินการ
        case 350: // รอเช็คคืน
        case 175: // ระหว่างนับ
        case 250: // ออนไลน์
          return "info";

        // Warn (Yellow/Orange)
        case 300: // เกินกำหนด, เช็คผ่าน, ใช้บางส่วน, จัดสินค้าแล้ว, รับบางส่วน
        case 400: // เช็คคืน
        case 500: // รอสินค้า, รับบางส่วน
        case 270: // คืนใบแจ้งหนี้แล้ว, รอมัดจำ
        case 240: // มัดจำแล้ว
        case 280: // มัดจำแล้ว
        case 900: // รอมัดจำ
          return "warn";

        // Danger (Red)
        case 800: // ปฏิเสธ, วางบิลแล้ว, รับเกิน
        case 1400: // ปฏิเสธ
        case 2000: // ยกเลิก
        case 3000: // ปิด, ยกเลิก
        case 1000: // หมดอายุ
          return "danger";

        default:
          return "default"; // For unknown or undefined statusId
      }
    }
}